NetSuiteWebhook/NetSuiteWebhook/Files/NS_FU/Fusion/Customer/UpdateAccount/Request -BeforeSupressRem/updateCustomerAccount1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/applicationModule/types/" xmlns:cus="http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/" xmlns:cus1="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountContactRole/" xmlns:par="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/" xmlns:sour="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/sourceSystemRef/" xmlns:cus2="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountContact/" xmlns:cus3="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountRel/" xmlns:cus4="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountSiteUse/" xmlns:cus5="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountSite/" xmlns:cus6="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccount/">
   <soapenv:Header/>
   <soapenv:Body>
      <typ:updateCustomerAccount>
         <typ:customerAccount>
		    <cus:RequestId>234324242342</cus:RequestId>
            <cus:CustomerAccountId>300000003444618</cus:CustomerAccountId>
            <cus:PartyId>300000003444540</cus:PartyId>
            <cus:AccountNumber>MagicTest03</cus:AccountNumber>
            <cus:CustomerClassCode>PUBLIC SECTOR COMPANIES</cus:CustomerClassCode>
            <cus:AccountName>Magic Soft 02</cus:AccountName>
            <cus:CustomerAccountSite>
               <cus:PartySiteId>300000003444544</cus:PartySiteId>
               <cus:CreatedByModule>SIS</cus:CreatedByModule>
               <cus:SetId>300000000003311</cus:SetId>
               <cus:StartDate>2020-09-25</cus:StartDate>
               <cus:CustomerAccountSiteUse>
                  <cus:SiteUseCode>BILL_TO</cus:SiteUseCode>
                  <cus:CreatedByModule>SIS</cus:CreatedByModule>
                  <cus:StartDate>2020-09-25</cus:StartDate>
                  <cus:OriginalSystemReference>
                     <par:OrigSystem>SIS</par:OrigSystem>
                     <par:OrigSystemReference>300000001771255</par:OrigSystemReference>
                     <par:OwnerTableName>HZ_CUST_SITE_USES_ALL</par:OwnerTableName>
                     <par:CreatedByModule>SIS</par:CreatedByModule>
                  </cus:OriginalSystemReference>
                </cus:CustomerAccountSiteUse>
               <cus:OriginalSystemReference>
                  <par:OrigSystem>SIS</par:OrigSystem>
                  <par:OrigSystemReference>300000001771254</par:OrigSystemReference>
                  <par:OwnerTableName>HZ_CUST_ACCT_SITES_ALL</par:OwnerTableName>
                  <par:CreatedByModule>SIS</par:CreatedByModule>
               </cus:OriginalSystemReference>
               </cus:CustomerAccountSite>
            <cus:OriginalSystemReference>
               <par:OrigSystem>SIS</par:OrigSystem>
               <par:OrigSystemReference>300000001771253</par:OrigSystemReference>
               <par:OwnerTableName>HZ_CUST_ACCOUNTS</par:OwnerTableName>
               <par:CreatedByModule>SIS</par:CreatedByModule>
            </cus:OriginalSystemReference>
			<cus:CustAcctInformation>
               <cus6:CustAccountId></cus6:CustAccountId>
               <cus6:cinNum></cus6:cinNum>
               <cus6:customerProvidedCode></cus6:customerProvidedCode>
               <cus6:customerGroup></cus6:customerGroup>
               <cus6:wthTaxCode></cus6:wthTaxCode>
               <cus6:defaultTdsRate></cus6:defaultTdsRate>
               <cus6:concessional></cus6:concessional>
               <cus6:validityPeriod></cus6:validityPeriod>
               <cus6:thresholdLimit></cus6:thresholdLimit>
               <cus6:virtualAccountNum></cus6:virtualAccountNum>
               <cus6:salesRep>TestSalesRep</cus6:salesRep>
               <cus6:warehouse>1</cus6:warehouse>
               <cus6:marketing>1</cus6:marketing>
               <cus6:paymentTerms></cus6:paymentTerms>
            </cus:CustAcctInformation>
            </typ:customerAccount>
      </typ:updateCustomerAccount>
   </soapenv:Body>
</soapenv:Envelope>